# Introduction to Pandas

In this section of the course we will learn how to use pandas for data analysis. You can think of pandas as an extremely powerful version of Excel, with a lot more features. In this section of the course, you should go through the notebooks in this order:

* Introduction to Pandas
* Series
* DataFrames
* Missing Data
* GroupBy
* Merging,Joining,and Concatenating
* Operations
* Data Input and Output

# Series

In [1]:
import numpy as np
import pandas as pd

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

** Using Lists**

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

** NumPy Arrays **

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

** Dictionary**

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types:

In [9]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [10]:
# Even functions (although unlikely that you will use this)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [11]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [12]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [13]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [14]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [15]:
ser1['USA']

1

Operations are then also done based off of index:

In [16]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

* Dataframe is a collection of series.
* Here we have additional columns to be mentioned

In [17]:
import pandas as pd
import numpy as np

In [18]:
from numpy.random import randn
np.random.seed(101)  # seed is used to follow same random numbers to generate for everyone

In [19]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['W','X','Y','Z']) # For creating data manually but usually we read data from csv files
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

### Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [20]:
df['W']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: W, dtype: float64

DataFrame Columns are just Series

In [21]:
type(df['W'])

pandas.core.series.Series

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
# Pass a list of column names
df[['W','Z']]

          W         Z
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [24]:
type(df[['W','Z']])

pandas.core.frame.DataFrame

In [25]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: W, dtype: float64

## Creating a new column:

In [26]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

**Removing Columns**

* Unless using 'inplace' keyword the changes while made for dropping will not reflect

In [27]:
df.drop('new',axis=1) # always specify the axis because default the axis is 0 for index for dropping columns specify it as '1', axis=0-->row ;axis=1-->column

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [28]:
df

          W         X         Y         Z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

In [29]:
df.drop('new',axis=1,inplace=True) # Not inplace unless specified!

In [30]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [31]:
# Dropping Rows

df.drop('e')

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

**Selecting Rows**

* Rows can be selected in two ways:
* loc --> specify the label name of row
* iloc--specify the index position

In [32]:
df.loc['c']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: c, dtype: float64

In [33]:
df.iloc[2] #Or select based off of position instead of label

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: c, dtype: float64

**Selecting subset of rows and columns**

In [34]:
df.loc['b','Y']

-0.8480769834036315

In [35]:
df.iloc[:2,:3]

          W         X         Y
a  2.706850  0.628133  0.907969
b  0.651118 -0.319318 -0.848077

In [36]:
df.loc[['a','b'],['W','Y']]

          W         Y
a  2.706850  0.907969
b  0.651118 -0.848077

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to nump

In [37]:
booldf=df>0

In [38]:
booldf

       W      X      Y      Z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [39]:
df[df>0]

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [40]:
df[df['W']>0]

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [41]:
resultdf=df[df['Z']<0]

In [42]:
resultdf

          W         X         Y         Z
c -2.018168  0.740122  0.528813 -0.589001

In [43]:
df[df['W']>0]['X'] # grabbing indexing subset

a    0.628133
b   -0.319318
d   -0.758872
e    1.978757
Name: X, dtype: float64

In [44]:
df[df['W']>0][['X','Z']] #passing a list of columns

          X         Z
a  0.628133  0.503826
b -0.319318  0.605965
d -0.758872  0.955057
e  1.978757  0.683509

For two conditions you can use | and & with parenthesis:

In [45]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
e  0.190794  1.978757  2.605967  0.683509

### More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [46]:
# Reset to default 0,1...n index
"""
Note: This changes will not be saved until inplace is used
"""
df.reset_index()

  index         W         X         Y         Z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [47]:
newind = 'CA NY WY OR CO'.split()

In [48]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [49]:
df['states']=newind

In [50]:
df

          W         X         Y         Z states
a  2.706850  0.628133  0.907969  0.503826     CA
b  0.651118 -0.319318 -0.848077  0.605965     NY
c -2.018168  0.740122  0.528813 -0.589001     WY
d  0.188695 -0.758872 -0.933237  0.955057     OR
e  0.190794  1.978757  2.605967  0.683509     CO

In [51]:
"""
For setting an index states as new index use set_index function. again if inplace not used changes wont be saved
"""

df.set_index('states')

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

### Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

* pd.MultiIndex.from_tuples is a function in the pandas library in Python that creates a multi-level index from a list of tuples. This is useful when you want to represent hierarchical or multi-dimensional data.

In [52]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) # to make list of tuples
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [53]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [54]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [55]:
df.index.names

FrozenList([None, None])

In [56]:
df.index.names=['Groups','num']

In [57]:
df

                   A         B
Groups num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [58]:
df.loc['G1']

            A         B
num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [59]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

frst level index--> G1 ,G2
second level index--> 1,2,3 or Index Hierarchy

In [60]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

**Cross Section**

In [61]:
df

                   A         B
Groups num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [62]:
df.xs(1,level='num')  # Cross section of partcilaur index for both levels bypassing the first level

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Handling Data in dataframes

**Missing Data**

In [63]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [64]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Note:
* dropna()-->used to drop null values if the null values very less in a dataset
* we can also specify the threshold of tolerance of null values

In [65]:
df.dropna(thresh=2) # row 1 is retained as it falls below the threshold value of Nan

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [66]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [67]:
df.fillna("Value")

       A      B  C
0    1.0    5.0  1
1    2.0  Value  2
2  Value  Value  3

**Usually the null values are filled either mean or median of the dataset**

In [68]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

**Incase of presence of outliers filling the missing values with mean might not be right choice so we go with median of the data**

In [69]:
df['A'].fillna(value=df['A'].median())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

**GroupBy**

The groupby method allows you to group rows of data together and call aggregate functions

In [70]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [71]:
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [72]:
agg=df.groupby('Company')

In [73]:
agg.sum('Sales')

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [74]:
agg.mean('Sales')

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [75]:
df.groupby('Company').sum('Sales').loc['FB']

Sales    593
Name: FB, dtype: int64

In [76]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [77]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [78]:
df.groupby('Company').count() #returns the number of instances

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [79]:
agg.describe() # Gives bunch of information

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [80]:
agg.describe().T

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [81]:
df.groupby('Company').describe().loc['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

**Merging, Joining, and Concatenating**

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating. In this lecture we will discuss these 3 methods with examples.

In [82]:
import pandas as pd

In [83]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [84]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [85]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [86]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [87]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [88]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

**Concatenation**

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use pd.concat and pass in a list of DataFrames to concatenate together:

In [89]:
df_concat=pd.concat([df1,df2,df3])

In [90]:
df_concat

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [91]:
df_col_concat=pd.concat([df1,df2,df3],axis=1)
df_col_concat #making sure the data has values to concat properly

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [92]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [93]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [94]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

**Merging**

The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [95]:
pd.merge(left,right,how='inner',on='key') #by default its inner join

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [96]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [97]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [98]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [99]:
pd.merge(left, right, on=['key1', 'key2']) # merge columns where both key pairs matching

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

When merging dataframes in pandas, you can specify different types of joins to control how the data is combined. Here are the common types of joins:

*Inner Join:* This type of join returns only the rows where there is a match in both dataframes based on the join keys.

Outer (Full) Join: This join returns all rows from both dataframes, filling in missing values with NaN where there is no match.

*Left (Left Outer) Join*: This join returns all rows from the left dataframe and the matched rows from the right dataframe. If there is no match, it fills in missing values with NaN.

*Right (Right Outer) Join:* This join returns all rows from the right dataframe and the matched rows from the left dataframe. If there is no match, it fills in missing values with NaN.

*Left Excluding Join:* This join returns all rows from the left dataframe that do not have a match in the right dataframe.

*Right Excluding Join:* This join returns all rows from the right dataframe that do not have a match in the left dataframe.

In [100]:
import pandas as pd

# Create two sample dataframes
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],
                    'value': [1, 2, 3, 4]})

df2 = pd.DataFrame({'key': ['B', 'C', 'D', 'E'],
                    'value': [5, 6, 7, 8]})



# Inner join
inner_join = pd.merge(df1, df2, on='key', how='inner')

# Outer join
outer_join = pd.merge(df1, df2, on='key', how='outer')

# Left join
left_join = pd.merge(df1, df2, on='key', how='left')

# Right join
right_join = pd.merge(df1, df2, on='key', how='right')

# Left excluding join
left_excluding_join = pd.merge(df1, df2, on='key', how='left', indicator=True).query('_merge == "left_only"').drop('_merge', 1)

# Right excluding join
right_excluding_join = pd.merge(df1, df2, on='key', how='right', indicator=True).query('_merge == "right_only"').drop('_merge', 1)


print('First dataframe')
print(df1)
print('second dataframe')
print(df2)
print("Inner Join:")
print(inner_join)
print("\nOuter Join:")
print(outer_join)
print("\nLeft Join:")
print(left_join)
print("\nRight Join:")
print(right_join)
print("\nLeft Excluding Join:")
print(left_excluding_join)
print("\nRight Excluding Join:")
print(right_excluding_join)

First dataframe
  key  value
0   A      1
1   B      2
2   C      3
3   D      4
second dataframe
  key  value
0   B      5
1   C      6
2   D      7
3   E      8
Inner Join:
  key  value_x  value_y
0   B        2        5
1   C        3        6
2   D        4        7

Outer Join:
  key  value_x  value_y
0   A      1.0      NaN
1   B      2.0      5.0
2   C      3.0      6.0
3   D      4.0      7.0
4   E      NaN      8.0

Left Join:
  key  value_x  value_y
0   A        1      NaN
1   B        2      5.0
2   C        3      6.0
3   D        4      7.0

Right Join:
  key  value_x  value_y
0   B      2.0        5
1   C      3.0        6
2   D      4.0        7
3   E      NaN        8

Left Excluding Join:
  key  value_x  value_y
0   A        1      NaN

Right Excluding Join:
  key  value_x  value_y
3   E      NaN        8

C:\Users\Hemac\AppData\Local\Temp\ipykernel_27492\3850261292.py:25: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  left_excluding_join = pd.merge(df1, df2, on='key', how='left', indicator=True).query('_merge == "left_only"').drop('_merge', 1)
C:\Users\Hemac\AppData\Local\Temp\ipykernel_27492\3850261292.py:28: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  right_excluding_join = pd.merge(df1, df2, on='key', how='right', indicator=True).query('_merge == "right_only"').drop('_merge', 1)

**Joining**

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [101]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [102]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [103]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [104]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [105]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [106]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

* unique()--> returns unqiue values
* nunique()-->number of unique values
* value_counts()-->how many times the unique value occured in that column

In [107]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [108]:
df['col2'].nunique()

3

In [109]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [110]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

**Applying Functions**

* Pandas has ability to pass our custom functions using apply method to our dataframe which will broadcast to entire dataframe

In [111]:
def times2(x):
    return x*2

In [112]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [113]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [114]:
df.columns #to get list of columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [115]:
df.index #to get list of indices

RangeIndex(start=0, stop=4, step=1)

In [116]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [117]:
df.isnull() # to check if null values are present

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [118]:
df['col1'].isnull()

0    False
1    False
2    False
3    False
Name: col1, dtype: bool

**Pivot Tables**

In [119]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [120]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

a pivot table takes data that is structured in rows and columns and provides a multidimensional view by allowing you to pivot, or rotate, the data axes to see different summaries. You can perform operations like grouping, sorting, averaging, summing, and counting data within the pivot table to gain insights into the underlying data. It's particularly useful for analyzing large datasets and identifying patterns or trends.

In [121]:
df.pivot_table(values=['D'],index=['A','B'],columns=['C']) #column for x and column for y

           D
C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

* CSV
* EXCEL
* HTML
* SQL

In [122]:
pwd #path where we have jupyter notebook

'C:\\Users\\Hemac'

**CSV**

In [123]:
df = pd.read_csv('example') #read csv file
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [124]:
df.to_csv('output',index=False) #write csv file

In [125]:
pd.read_csv('output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

**EXCEL**

In [126]:
pip install xlrd

Requirement already satisfied: xlrd in c:\users\hemac\appdata\local\programs\python\python310\lib\site-packages (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [127]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\hemac\appdata\local\programs\python\python310\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\hemac\appdata\local\programs\python\python310\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [128]:
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [129]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet2')

**HTML**

In [130]:
pip install lxml

Requirement already satisfied: lxml in c:\users\hemac\appdata\local\programs\python\python310\lib\site-packages (5.2.1)
Note: you may need to restart the kernel to use updated packages.

In [131]:
pip install html5lib

Requirement already satisfied: html5lib in c:\users\hemac\appdata\local\programs\python\python310\lib\site-packages (1.1)
Requirement already satisfied: six>=1.9 in c:\users\hemac\appdata\local\programs\python\python310\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\users\hemac\appdata\local\programs\python\python310\lib\site-packages (from html5lib) (0.5.1)
Note: you may need to restart the kernel to use updated packages.

In [132]:
pip install BeautifulSoup4

Requirement already satisfied: BeautifulSoup4 in c:\users\hemac\appdata\local\programs\python\python310\lib\site-packages (4.12.3)
Requirement already satisfied: soupsieve>1.2 in c:\users\hemac\appdata\local\programs\python\python310\lib\site-packages (from BeautifulSoup4) (2.5)
Note: you may need to restart the kernel to use updated packages.

In [136]:
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')
type(df)

list

In [137]:
df

[                             Bank NameBank       CityCity StateSt  CertCert  \
 0    Republic First Bank dba Republic Bank   Philadelphia      PA     27332
 1                            Citizens Bank       Sac City      IA      8758
 2                 Heartland Tri-State Bank        Elkhart      KS     25851
 3                      First Republic Bank  San Francisco      CA     59017
 4                           Signature Bank       New York      NY     57053
 ..                                     ...            ...     ...       ...
 564                     Superior Bank, FSB       Hinsdale      IL     32646
 565                    Malta National Bank          Malta      OH      6629
 566        First Alliance Bank & Trust Co.     Manchester      NH     34264
 567      National State Bank of Metropolis     Metropolis      IL      3815
 568                       Bank of Honolulu       Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0      Fulton Bank, National Association      April 26, 2024     10546
 1              Iowa Trust & Savings Bank    November 3, 2023     10545
 2                 Dream First Bank, N.A.       July 28, 2023     10544
 3              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
 4                    Flagstar Bank, N.A.      March 12, 2023     10540
 ..                                   ...                 ...       ...
 564                Superior Federal, FSB       July 27, 2001      6004
 565                    North Valley Bank         May 3, 2001      4648
 566  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 567              Banterra Bank of Marion   December 14, 2000      4646
 568                   Bank of the Orient    October 13, 2000      4645

 [569 rows x 7 columns]]

In [140]:
df.index

In [143]:
df[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540

____

**SQL**

Let's stop here for now and move on to DataFrames, which will expand on the concept of Series!
# Great Job!